In [1]:
#pip install pandas

In [2]:
import numpy as np
import pandas as pd

## Series

In [3]:
myList = [1, 2, 3, 4]
myLabels = ['w', 'x', 'y', 'z']
myArr = np.array(myList)
myDict = {'a':1, 'b':2, 'c':3, 'd':4}

In [4]:
pd.Series(myList)

0    1
1    2
2    3
3    4
dtype: int64

In [5]:
mySer = pd.Series(data=myList, index=myLabels)
mySer

w    1
x    2
y    3
z    4
dtype: int64

In [6]:
mySer[2]

3

In [7]:
mySer['y']

3

In [8]:
pd.Series(myArr)

0    1
1    2
2    3
3    4
dtype: int64

In [9]:
pd.Series(myDict)

a    1
b    2
c    3
d    4
dtype: int64

## DataFrame

In [10]:
df = pd.DataFrame(np.random.randint(1, 100, (5, 6)), 
             index=['A', 'B', 'C', 'D', 'E'],
            columns='U V W X Y Z'.split())

df

    U   V   W   X   Y   Z
A  70  54  30  88  20  26
B  68  65  42  75  86  11
C  66  63  46  99  28  41
D  54   1  29  17   8  31
E  47  39  94  28   2  79

In [11]:
df['V'] #Grab a column from the dataframe

A    54
B    65
C    63
D     1
E    39
Name: V, dtype: int64

In [12]:
df['V']['A']

54

In [13]:
df['V'][0]

54

In [14]:
df[['V', 'X']] #Grab multiple columns from the dataframe

    V   X
A  54  88
B  65  75
C  63  99
D   1  17
E  39  28

In [15]:
df['New'] = df['V'] + df['X'] #Creating a new column

In [16]:
df

    U   V   W   X   Y   Z  New
A  70  54  30  88  20  26  142
B  68  65  42  75  86  11  140
C  66  63  46  99  28  41  162
D  54   1  29  17   8  31   18
E  47  39  94  28   2  79   67

In [17]:
df['New'] = 100 #Overwriting an existing column

In [18]:
df

    U   V   W   X   Y   Z  New
A  70  54  30  88  20  26  100
B  68  65  42  75  86  11  100
C  66  63  46  99  28  41  100
D  54   1  29  17   8  31  100
E  47  39  94  28   2  79  100

In [19]:
df.drop('New', axis=1) #Temporarily drop a column or row

    U   V   W   X   Y   Z
A  70  54  30  88  20  26
B  68  65  42  75  86  11
C  66  63  46  99  28  41
D  54   1  29  17   8  31
E  47  39  94  28   2  79

In [20]:
df

    U   V   W   X   Y   Z  New
A  70  54  30  88  20  26  100
B  68  65  42  75  86  11  100
C  66  63  46  99  28  41  100
D  54   1  29  17   8  31  100
E  47  39  94  28   2  79  100

In [21]:
df.drop('New', axis=1, inplace=True) #Permanently drop a row or column

In [22]:
df

    U   V   W   X   Y   Z
A  70  54  30  88  20  26
B  68  65  42  75  86  11
C  66  63  46  99  28  41
D  54   1  29  17   8  31
E  47  39  94  28   2  79

In [23]:
df.shape

(5, 6)

In [24]:
df['U']

A    70
B    68
C    66
D    54
E    47
Name: U, dtype: int64

In [25]:
df.loc['B'] #To fetch a row

U    68
V    65
W    42
X    75
Y    86
Z    11
Name: B, dtype: int64

In [26]:
df.iloc[1] #To fetch a row by its index position

U    68
V    65
W    42
X    75
Y    86
Z    11
Name: B, dtype: int64

## Conditional Selection

In [27]:
df

    U   V   W   X   Y   Z
A  70  54  30  88  20  26
B  68  65  42  75  86  11
C  66  63  46  99  28  41
D  54   1  29  17   8  31
E  47  39  94  28   2  79

In [28]:
df['X'] %2 == 0

A     True
B    False
C    False
D    False
E     True
Name: X, dtype: bool

In [29]:
df[df['X'] %2 == 0]

    U   V   W   X   Y   Z
A  70  54  30  88  20  26
E  47  39  94  28   2  79

In [30]:
df[df['X'] %2 == 0]['Z']

A    26
E    79
Name: Z, dtype: int64

## Importing a CSV File

In [31]:
heart = pd.read_csv('heart.csv')
heart

,age,sex,cp,trtbps,chol,fbs,restecg,thalachh,exng,oldpeak,slp,caa,thall,output
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
298,57,0,0,140,241,0,1,123,1,0.2,1,0,3,0
299,45,1,3,110,264,0,1,132,0,1.2,1,0,3,0
300,68,1,0,144,193,1,1,141,0,3.4,1,2,3,0
301,57,1,0,130,131,0,1,115,1,1.2,1,1,3,0
302,57,0,1,130,236,0,0,174,0,0.0,1,1,2,0

## Missing Values

In [66]:
d = {'A':[1, 2, np.nan], 'B':[5, np.nan, np.nan], 'C':[1, 2, 3]}
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [67]:
df.isnull()

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

In [33]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [34]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [35]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [36]:
df.fillna(value='FILL')

      A     B  C
0   1.0   5.0  1
1   2.0  FILL  2
2  FILL  FILL  3

In [37]:
df.fillna(df.mean())

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

In [38]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [39]:
df.fillna(df.mean(), inplace=True)

In [40]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

## Grouping

In [41]:
data = {'Company':['GOOGLE', 'FB', 'GOOGLE', 'MSFT', 'FB', 'MSFT'], 
        'Person':['Same', 'Charlie', 'Amy', 'Jack', 'Vanessa', 'Eric'], 
        'Sales':[200, 120, 300, 50, 600, 550]}

df = pd.DataFrame(data)
df

  Company   Person  Sales
0  GOOGLE     Same    200
1      FB  Charlie    120
2  GOOGLE      Amy    300
3    MSFT     Jack     50
4      FB  Vanessa    600
5    MSFT     Eric    550

In [42]:
df.mean()

Sales    303.333333
dtype: float64

In [43]:
df.groupby('Company')

In [44]:
df.groupby('Company').mean()

         Sales
Company
FB         360
GOOGLE     250
MSFT       300

In [45]:
df.describe()

            Sales
count    6.000000
mean   303.333333
std    226.862660
min     50.000000
25%    140.000000
50%    250.000000
75%    487.500000
max    600.000000

In [46]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min    25%    50%    75%    max
Company
FB        2.0  360.0  339.411255  120.0  240.0  360.0  480.0  600.0
GOOGLE    2.0  250.0   70.710678  200.0  225.0  250.0  275.0  300.0
MSFT      2.0  300.0  353.553391   50.0  175.0  300.0  425.0  550.0

## Unique Values

In [47]:
df['Company'].unique()

array(['GOOGLE', 'FB', 'MSFT'], dtype=object)

In [48]:
df['Company'].nunique()

3

In [49]:
df['Company'].value_counts()

MSFT      2
FB        2
GOOGLE    2
Name: Company, dtype: int64

## Custom Functions

In [51]:
df

  Company   Person  Sales
0  GOOGLE     Same    200
1      FB  Charlie    120
2  GOOGLE      Amy    300
3    MSFT     Jack     50
4      FB  Vanessa    600
5    MSFT     Eric    550

In [50]:
def times10(x):
    return x * 10

In [52]:
df['Sales'].apply(times10)

0    2000
1    1200
2    3000
3     500
4    6000
5    5500
Name: Sales, dtype: int64

In [53]:
df['Sales'].apply(lambda x : x * 10)

0    2000
1    1200
2    3000
3     500
4    6000
5    5500
Name: Sales, dtype: int64

In [55]:
df['Length'] = df['Person'].apply(len)

In [56]:
df

  Company   Person  Sales  Length
0  GOOGLE     Same    200       4
1      FB  Charlie    120       7
2  GOOGLE      Amy    300       3
3    MSFT     Jack     50       4
4      FB  Vanessa    600       7
5    MSFT     Eric    550       4

In [57]:
df.columns

Index(['Company', 'Person', 'Sales', 'Length'], dtype='object')

In [58]:
df.index

RangeIndex(start=0, stop=6, step=1)

## Changing Column Names

In [59]:
df.rename(columns={'Person':'Employee'})

  Company Employee  Sales  Length
0  GOOGLE     Same    200       4
1      FB  Charlie    120       7
2  GOOGLE      Amy    300       3
3    MSFT     Jack     50       4
4      FB  Vanessa    600       7
5    MSFT     Eric    550       4

In [60]:
df.rename(columns={'Person':'Employee'}, inplace=True)

In [61]:
df

  Company Employee  Sales  Length
0  GOOGLE     Same    200       4
1      FB  Charlie    120       7
2  GOOGLE      Amy    300       3
3    MSFT     Jack     50       4
4      FB  Vanessa    600       7
5    MSFT     Eric    550       4

## Sorting

In [62]:
df.sort_values('Sales')

  Company Employee  Sales  Length
3    MSFT     Jack     50       4
1      FB  Charlie    120       7
0  GOOGLE     Same    200       4
2  GOOGLE      Amy    300       3
5    MSFT     Eric    550       4
4      FB  Vanessa    600       7

In [63]:
df.sort_values('Sales', ascending=False)

  Company Employee  Sales  Length
4      FB  Vanessa    600       7
5    MSFT     Eric    550       4
2  GOOGLE      Amy    300       3
0  GOOGLE     Same    200       4
1      FB  Charlie    120       7
3    MSFT     Jack     50       4

## Input & Output

In [68]:
pokemon = pd.read_csv('pokemon.csv')

In [69]:
pokemon.head()

            Name  Total  HP  Attack  Defence  Sp_attack  Sp_defence  Speed
0      Bulbasaur    318  45      49       49         65          65     45
1        Ivysaur    405  60      62       63         80          80     60
2       Venusaur    525  80      82       83        100         100     80
3  Mega Venusaur    625  80     100      123        122         120     80
4     Charmander    309  39      52       43         60          50     65

In [70]:
pokemon.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1045 entries, 0 to 1044
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        1045 non-null   object
 1   Total       1045 non-null   int64
 2   HP          1045 non-null   int64
 3   Attack      1045 non-null   int64
 4   Defence     1045 non-null   int64
 5   Sp_attack   1045 non-null   int64
 6   Sp_defence  1045 non-null   int64
 7   Speed       1045 non-null   int64
dtypes: int64(7), object(1)
memory usage: 65.4+ KB

In [71]:
pokemon.describe()

,Total,HP,Attack,Defence,Sp_attack,Sp_defence,Speed
count,1045.000000,1045.000000,1045.000000,1045.000000,1045.000000,1045.000000,1045.000000
mean,439.314833,70.067943,80.466986,74.661244,73.022010,72.288995,68.807656
std,121.970701,26.671411,32.413665,31.237903,32.724797,28.074148,30.210094
min,175.000000,1.000000,5.000000,5.000000,10.000000,20.000000,5.000000
25%,330.000000,50.000000,55.000000,50.000000,50.000000,50.000000,45.000000
50%,458.000000,68.000000,77.000000,70.000000,65.000000,70.000000,65.000000
75%,515.000000,82.000000,100.000000,90.000000,95.000000,90.000000,90.000000
max,1125.000000,255.000000,190.000000,250.000000,194.000000,250.000000,200.000000

In [72]:
pokemon['Name'].nunique()

1035

In [73]:
pokemon['Name'].unique()

array(['Bulbasaur', 'Ivysaur', 'Venusaur', ..., 'Calyrex', 'Mega Calyrex',
       'Mega Calyrex X'], dtype=object)

In [75]:
(pokemon['Attack'] > 100) & (pokemon['Attack']%2==0)

0       False
1       False
2       False
3       False
4       False
        ...
1040    False
1041    False
1042    False
1043    False
1044    False
Name: Attack, Length: 1045, dtype: bool

In [78]:
finalDf = pokemon[(pokemon['Attack'] > 100) & (pokemon['Attack']%2==0)]
finalDf

,Name,Total,HP,Attack,Defence,Sp_attack,Sp_defence,Speed
7,Mega Charizard,634,78,130,111,130,85,100
8,Mega Charizard X,634,78,104,78,159,115,100
19,Mega Beedrill,495,65,150,40,15,80,145
45,Nidoking,505,81,102,77,85,75,85
77,Arcanine,555,90,110,80,100,80,95
...,...,...,...,...,...,...,...,...
1030,Zamazenta,720,92,130,145,80,145,128
1031,Mega Zamazenta,670,92,130,115,80,115,138
1035,Urshifu,550,100,130,100,63,60,97
1036,Mega Urshifu,550,100,130,100,63,60,97
1037,Zarude,600,105,120,105,70,95,105

In [77]:
pokemon[(pokemon['Attack'] > 100) & (pokemon['Attack']%2==0)]['Name']

7         Mega Charizard
8       Mega Charizard X
19         Mega Beedrill
45              Nidoking
77              Arcanine
              ...
1030           Zamazenta
1031      Mega Zamazenta
1035             Urshifu
1036        Mega Urshifu
1037              Zarude
Name: Name, Length: 123, dtype: object

In [82]:
finalDf.to_csv('strong pokemon.csv')

In [83]:
strongPokemon = pd.read_csv('strong pokemon.csv')

In [84]:
strongPokemon.head()

,Unnamed: 0,Name,Total,HP,Attack,Defence,Sp_attack,Sp_defence,Speed
0,7,Mega Charizard,634,78,130,111,130,85,100
1,8,Mega Charizard X,634,78,104,78,159,115,100
2,19,Mega Beedrill,495,65,150,40,15,80,145
3,45,Nidoking,505,81,102,77,85,75,85
4,77,Arcanine,555,90,110,80,100,80,95